ezois_ka/oooezoiskaobmen/src/Documents/ИзмененияСведенийСотрудниковДляВоенкомата/ИзмененияСведенийСотрудниковДляВоенкомата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзмененияСведенийСотрудниковДляВоенкомата</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленоВВоенкомат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаВУР</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьОтветственногоЗаВУР</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдресОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаОтчетности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Военкомат</name>
      <type>
        <types>CatalogRef.Военкоматы</types>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтраховойНомерСФР</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пол</name>
      <type>
        <types>EnumRef.ПолФизическогоЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПаспорта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПаспорта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачиПаспорта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидИзменений</name>
      <type>
        <types>EnumRef.ВидИзмененийСведенийСотрудниковДляВоенкомата</types>
      </type>
    </attributes>
    <attributes>
      <name>СодержаниеИзменений</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛистокСообщения</name>
      <type>
        <types>DocumentRef.ЛистокСообщенияДляВоенкомата</types>
      </type>
    </attributes>
    <attributes>
      <name>Звание</name>
      <type>
        <types>CatalogRef.ЗванияГражданскогоВоинскогоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКомандыПартии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Забронирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Documents/ИзмененияСведенийСотрудниковДляВоенкомата/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ВидОтчета = "ВнесениеИзменений";
	Если Не ЗначениеЗаполнено(ИмяФайлаОтчетности) Тогда
		ИмяФайлаОтчетности = ВоинскийУчет.ИмяФайлаОтчетности(ВидОтчета, Организация, Дата);
	Иначе		
		УИДИзИмениФайла = Прав(ИмяФайлаОтчетности, 36);
		Если Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(УИДИзИмениФайла) Тогда
			УИДИзИмениФайла = Строка(Новый УникальныйИдентификатор);	
		КонецЕсли;	
		ИмяФайлаОтчетности = ВоинскийУчет.ИмяФайлаОтчетности(ВидОтчета, Организация, Дата, УИДИзИмениФайла);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ИзмененияСведенийСотрудниковДляВоенкомата.ОбработкаФормированияФайла(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
